IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   77 WS-A PIC 99 VALUE IS 50.

PROCEDURE DIVISION.
	DISPLAY "A: " WITH NO ADVANCING.
	ACCEPT WS-A.
	ADD 1 TO WS-A.
	DISPLAY "RESULT: " WS-A.
	STOP RUN.
