IDENTIFICATION DIVISION.
PROGRAM-ID. DECIMAL.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   77 SALARIO PIC  999999V99.

PROCEDURE DIVISION.   
   DISPLAY "SALARIO: " WITH NO ADVANCING.
   ACCEPT SALARIO.
   MULTIPLY SALARIO BY 1.5 GIVING SALARIO.
   DISPLAY SALARIO. 
   STOP RUN.
